{
  "architectures": [
    "MultimodalModel"
  ],
  "bert_model_name": "bert-base-uncased",
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2,
    "LABEL_3": 3,
    "LABEL_4": 4
  },
  "model_type": "multimodal",
  "num_hidden_layers": 2,
  "roberta_model_name": "roberta-base",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vision_model_name": "microsoft/resnet-50",
  "vit_model_name": "google/vit-base-patch16-224"
}
